Ran Plan for 2 projects:

1. dir: `ec2` workspace: `default`
1. dir: `vpc` workspace: `default`
---

### 1. dir: `ec2` workspace: `default`
<details><summary>Show Output</summary>

```diff
mise WARN  No untrusted config files found.

08:44:03.909 WARN   Config ../vpc/terragrunt.hcl is a dependency of ./terragrunt.hcl that has no outputs, but mock outputs provided and returning those in dependency output.
08:44:03.909 INFO   Downloading Terraform configurations from . into ./.terragrunt-cache/RXR9kP42ZUTIeonp5j-TPNnRBYM/wZOpYGZo0sRAeL2jQdSaHGeRpHw
08:44:03.937 INFO   tofu: Initializing the backend...
08:44:04.102 INFO   tofu: 
08:44:04.102 INFO   tofu: Successfully configured the backend "s3"! OpenTofu will automatically
08:44:04.102 INFO   tofu: use this backend unless the backend configuration changes.
08:44:04.381 INFO   tofu: Initializing provider plugins...
08:44:04.381 INFO   tofu: - Reusing previous version of hashicorp/aws from the dependency lock file
08:44:05.598 INFO   tofu: - Installing hashicorp/aws v6.30.0 to the shared cache directory...
08:44:35.936 INFO   tofu: - Installed hashicorp/aws v6.30.0 (signed, key ID 0C0AF313E5FD9F80)
08:44:35.936 INFO   tofu: - Using hashicorp/aws v6.30.0 from the shared cache directory
08:44:35.937 INFO   tofu: Providers are signed by their developers.
08:44:35.937 INFO   tofu: If you'd like to know more about provider signing, you can read about it here:
08:44:35.937 INFO   tofu: https://opentofu.org/docs/cli/plugins/signing/
08:44:35.937 INFO   tofu: OpenTofu has made some changes to the provider dependency selections recorded
08:44:35.937 INFO   tofu: in the .terraform.lock.hcl file. Review those changes and commit them to your
08:44:35.938 INFO   tofu: version control system if they represent changes you intended to make.
08:44:35.939 INFO   tofu: ╷
08:44:35.939 INFO   tofu: │ Warning: Dependency lock file entries automatically updated
08:44:35.939 INFO   tofu: │ 
08:44:35.939 INFO   tofu: │ OpenTofu automatically rewrote some entries in your dependency lock file:
08:44:35.939 INFO   tofu: │   - registry.terraform.io/hashicorp/aws => registry.opentofu.org/hashicorp/aws
08:44:35.939 INFO   tofu: │ 
08:44:35.939 INFO   tofu: │ The version selections were preserved, but the hashes were not because the
08:44:35.939 INFO   tofu: │ OpenTofu project's provider releases are not byte-for-byte identical.
08:44:35.939 INFO   tofu: ╵
08:44:35.939 INFO   tofu: 
08:44:35.939 INFO   tofu: OpenTofu has been successfully initialized!
08:44:38.902 STDOUT tofu: OpenTofu used the selected providers to generate the following execution
08:44:38.902 STDOUT tofu: plan. Resource actions are indicated with the following symbols:
08:44:38.902 STDOUT tofu:   + create
08:44:38.902 STDOUT tofu: OpenTofu will perform the following actions:
08:44:38.902 STDOUT tofu:   # aws_instance.web will be created
08:44:38.902 STDOUT tofu:   + resource "aws_instance" "web" {
08:44:38.902 STDOUT tofu:       + ami                                  = "ami-0092e0c93f74c293a"
08:44:38.902 STDOUT tofu:       + arn                                  = (known after apply)
08:44:38.902 STDOUT tofu:       + associate_public_ip_address          = (known after apply)
08:44:38.902 STDOUT tofu:       + availability_zone                    = (known after apply)
08:44:38.902 STDOUT tofu:       + disable_api_stop                     = (known after apply)
08:44:38.902 STDOUT tofu:       + disable_api_termination              = (known after apply)
08:44:38.902 STDOUT tofu:       + ebs_optimized                        = (known after apply)
08:44:38.902 STDOUT tofu:       + enable_primary_ipv6                  = (known after apply)
08:44:38.902 STDOUT tofu:       + force_destroy                        = false
08:44:38.902 STDOUT tofu:       + get_password_data                    = false
08:44:38.902 STDOUT tofu:       + host_id                              = (known after apply)
08:44:38.902 STDOUT tofu:       + host_resource_group_arn              = (known after apply)
08:44:38.903 STDOUT tofu:       + iam_instance_profile                 = (known after apply)
08:44:38.903 STDOUT tofu:       + id                                   = (known after apply)
08:44:38.903 STDOUT tofu:       + instance_initiated_shutdown_behavior = (known after apply)
08:44:38.903 STDOUT tofu:       + instance_lifecycle                   = (known after apply)
08:44:38.903 STDOUT tofu:       + instance_state                       = (known after apply)
08:44:38.903 STDOUT tofu:       + instance_type                        = "t2.micro"
08:44:38.903 STDOUT tofu:       + ipv6_address_count                   = (known after apply)
08:44:38.903 STDOUT tofu:       + ipv6_addresses                       = (known after apply)
08:44:38.903 STDOUT tofu:       + key_name                             = (known after apply)
08:44:38.903 STDOUT tofu:       + monitoring                           = (known after apply)
08:44:38.903 STDOUT tofu:       + outpost_arn                          = (known after apply)
08:44:38.903 STDOUT tofu:       + password_data                        = (known after apply)
08:44:38.903 STDOUT tofu:       + placement_group                      = (known after apply)
08:44:38.903 STDOUT tofu:       + placement_group_id                   = (known after apply)
08:44:38.903 STDOUT tofu:       + placement_partition_number           = (known after apply)
08:44:38.903 STDOUT tofu:       + primary_network_interface_id         = (known after apply)
08:44:38.903 STDOUT tofu:       + private_dns                          = (known after apply)
08:44:38.903 STDOUT tofu:       + private_ip                           = (known after apply)
08:44:38.903 STDOUT tofu:       + public_dns                           = (known after apply)
08:44:38.903 STDOUT tofu:       + public_ip                            = (known after apply)
08:44:38.903 STDOUT tofu:       + region                               = "ap-northeast-2"
08:44:38.903 STDOUT tofu:       + secondary_private_ips                = (known after apply)
08:44:38.903 STDOUT tofu:       + security_groups                      = (known after apply)
08:44:38.903 STDOUT tofu:       + source_dest_check                    = true
08:44:38.903 STDOUT tofu:       + spot_instance_request_id             = (known after apply)
08:44:38.903 STDOUT tofu:       + subnet_id                            = "subnet-12345678"
08:44:38.903 STDOUT tofu:       + tags                                 = {
08:44:38.903 STDOUT tofu:           + "Name" = "atlantis-test-ec2"
08:44:38.903 STDOUT tofu:         }
08:44:38.903 STDOUT tofu:       + tags_all                             = {
08:44:38.903 STDOUT tofu:           + "Name" = "atlantis-test-ec2"
08:44:38.903 STDOUT tofu:         }
08:44:38.903 STDOUT tofu:       + tenancy                              = (known after apply)
08:44:38.903 STDOUT tofu:       + user_data_base64                     = (known after apply)
08:44:38.903 STDOUT tofu:       + user_data_replace_on_change          = false
08:44:38.903 STDOUT tofu:       + vpc_security_group_ids               = (known after apply)
08:44:38.903 STDOUT tofu:       + capacity_reservation_specification (known after apply)
08:44:38.903 STDOUT tofu:       + cpu_options (known after apply)
08:44:38.903 STDOUT tofu:       + ebs_block_device (known after apply)
08:44:38.903 STDOUT tofu:       + enclave_options (known after apply)
08:44:38.904 STDOUT tofu:       + ephemeral_block_device (known after apply)
08:44:38.904 STDOUT tofu:       + instance_market_options (known after apply)
08:44:38.904 STDOUT tofu:       + maintenance_options (known after apply)
08:44:38.904 STDOUT tofu:       + metadata_options (known after apply)
08:44:38.904 STDOUT tofu:       + network_interface (known after apply)
08:44:38.904 STDOUT tofu:       + primary_network_interface (known after apply)
08:44:38.904 STDOUT tofu:       + private_dns_name_options (known after apply)
08:44:38.904 STDOUT tofu:       + root_block_device (known after apply)
08:44:38.904 STDOUT tofu:     }
08:44:38.904 STDOUT tofu: Plan: 1 to add, 0 to change, 0 to destroy.
08:44:38.904 STDOUT tofu:
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d ec2
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.testdragon.dev/lock?id=pjg3335%252Ftest-atlantis%252Fec2%252Fdefault%252F)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d ec2
  ```
Plan: 1 to add, 0 to change, 0 to destroy.

---
### 2. dir: `vpc` workspace: `default`
<details><summary>Show Output</summary>

```diff
mise trusted /home/atlantis/.atlantis/repos/pjg3335/test-atlantis/7/default

08:44:02.992 INFO   Downloading Terraform configurations from . into ./.terragrunt-cache/iQDA73mnZpPVJMkqp3OmvB48q-k/c0La8Sl8ez0f65rWF5gdQoPvsPk
08:44:03.015 INFO   tofu: Initializing the backend...
08:44:03.410 INFO   tofu: 
08:44:03.410 INFO   tofu: Successfully configured the backend "s3"! OpenTofu will automatically
08:44:03.410 INFO   tofu: use this backend unless the backend configuration changes.
08:44:03.604 INFO   tofu: Initializing provider plugins...
08:44:03.604 INFO   tofu: - Reusing previous version of hashicorp/aws from the dependency lock file
08:44:05.599 INFO   tofu: - Installing hashicorp/aws v6.30.0 to the shared cache directory...
08:44:10.602 INFO   tofu: - Waiting for lock on cache directory ../../../../../../../.cache/terragrunt/providers
08:45:08.999 INFO   tofu: - Installed hashicorp/aws v6.30.0 (signed, key ID 0C0AF313E5FD9F80)
08:45:08.999 INFO   tofu: - Using hashicorp/aws v6.30.0 from the shared cache directory
08:45:09.001 INFO   tofu: Providers are signed by their developers.
08:45:09.001 INFO   tofu: If you'd like to know more about provider signing, you can read about it here:
08:45:09.001 INFO   tofu: https://opentofu.org/docs/cli/plugins/signing/
08:45:09.001 INFO   tofu: OpenTofu has made some changes to the provider dependency selections recorded
08:45:09.001 INFO   tofu: in the .terraform.lock.hcl file. Review those changes and commit them to your
08:45:09.001 INFO   tofu: version control system if they represent changes you intended to make.
08:45:09.002 INFO   tofu: ╷
08:45:09.002 INFO   tofu: │ Warning: Dependency lock file entries automatically updated
08:45:09.002 INFO   tofu: │ 
08:45:09.002 INFO   tofu: │ OpenTofu automatically rewrote some entries in your dependency lock file:
08:45:09.002 INFO   tofu: │   - registry.terraform.io/hashicorp/aws => registry.opentofu.org/hashicorp/aws
08:45:09.002 INFO   tofu: │ 
08:45:09.002 INFO   tofu: │ The version selections were preserved, but the hashes were not because the
08:45:09.002 INFO   tofu: │ OpenTofu project's provider releases are not byte-for-byte identical.
08:45:09.002 INFO   tofu: ╵
08:45:09.002 INFO   tofu: 
08:45:09.002 INFO   tofu: OpenTofu has been successfully initialized!
08:45:11.051 STDOUT tofu: OpenTofu used the selected providers to generate the following execution
08:45:11.051 STDOUT tofu: plan. Resource actions are indicated with the following symbols:
08:45:11.051 STDOUT tofu:   + create
08:45:11.051 STDOUT tofu: OpenTofu will perform the following actions:
08:45:11.051 STDOUT tofu:   # aws_subnet.public will be created
08:45:11.051 STDOUT tofu:   + resource "aws_subnet" "public" {
08:45:11.051 STDOUT tofu:       + arn                                            = (known after apply)
08:45:11.051 STDOUT tofu:       + assign_ipv6_address_on_creation                = false
08:45:11.051 STDOUT tofu:       + availability_zone                              = (known after apply)
08:45:11.051 STDOUT tofu:       + availability_zone_id                           = (known after apply)
08:45:11.051 STDOUT tofu:       + cidr_block                                     = "10.0.1.0/24"
08:45:11.051 STDOUT tofu:       + enable_dns64                                   = false
08:45:11.051 STDOUT tofu:       + enable_resource_name_dns_a_record_on_launch    = false
08:45:11.051 STDOUT tofu:       + enable_resource_name_dns_aaaa_record_on_launch = false
08:45:11.051 STDOUT tofu:       + id                                             = (known after apply)
08:45:11.051 STDOUT tofu:       + ipv6_cidr_block                                = (known after apply)
08:45:11.051 STDOUT tofu:       + ipv6_cidr_block_association_id                 = (known after apply)
08:45:11.051 STDOUT tofu:       + ipv6_native                                    = false
08:45:11.052 STDOUT tofu:       + map_public_ip_on_launch                        = false
08:45:11.052 STDOUT tofu:       + owner_id                                       = (known after apply)
08:45:11.052 STDOUT tofu:       + private_dns_hostname_type_on_launch            = (known after apply)
08:45:11.052 STDOUT tofu:       + region                                         = "ap-northeast-2"
08:45:11.052 STDOUT tofu:       + tags                                           = {
08:45:11.052 STDOUT tofu:           + "Name" = "atlantis-test-subnet"
08:45:11.052 STDOUT tofu:         }
08:45:11.052 STDOUT tofu:       + tags_all                                       = {
08:45:11.052 STDOUT tofu:           + "Name" = "atlantis-test-subnet"
08:45:11.052 STDOUT tofu:         }
08:45:11.052 STDOUT tofu:       + vpc_id                                         = (known after apply)
08:45:11.052 STDOUT tofu:     }
08:45:11.052 STDOUT tofu:   # aws_vpc.main will be created
08:45:11.052 STDOUT tofu:   + resource "aws_vpc" "main" {
08:45:11.052 STDOUT tofu:       + arn                                  = (known after apply)
08:45:11.052 STDOUT tofu:       + cidr_block                           = "10.0.0.0/16"
08:45:11.052 STDOUT tofu:       + default_network_acl_id               = (known after apply)
08:45:11.052 STDOUT tofu:       + default_route_table_id               = (known after apply)
08:45:11.052 STDOUT tofu:       + default_security_group_id            = (known after apply)
08:45:11.052 STDOUT tofu:       + dhcp_options_id                      = (known after apply)
08:45:11.052 STDOUT tofu:       + enable_dns_hostnames                 = (known after apply)
08:45:11.052 STDOUT tofu:       + enable_dns_support                   = true
08:45:11.052 STDOUT tofu:       + enable_network_address_usage_metrics = (known after apply)
08:45:11.052 STDOUT tofu:       + id                                   = (known after apply)
08:45:11.052 STDOUT tofu:       + instance_tenancy                     = "default"
08:45:11.052 STDOUT tofu:       + ipv6_association_id                  = (known after apply)
08:45:11.052 STDOUT tofu:       + ipv6_cidr_block                      = (known after apply)
08:45:11.052 STDOUT tofu:       + ipv6_cidr_block_network_border_group = (known after apply)
08:45:11.052 STDOUT tofu:       + main_route_table_id                  = (known after apply)
08:45:11.052 STDOUT tofu:       + owner_id                             = (known after apply)
08:45:11.052 STDOUT tofu:       + region                               = "ap-northeast-2"
08:45:11.052 STDOUT tofu:       + tags                                 = {
08:45:11.052 STDOUT tofu:           + "Name" = "atlantis-test-vpc"
08:45:11.052 STDOUT tofu:         }
08:45:11.052 STDOUT tofu:       + tags_all                             = {
08:45:11.052 STDOUT tofu:           + "Name" = "atlantis-test-vpc"
08:45:11.052 STDOUT tofu:         }
08:45:11.052 STDOUT tofu:     }
08:45:11.052 STDOUT tofu: Plan: 2 to add, 0 to change, 0 to destroy.
08:45:11.052 STDOUT tofu: 
08:45:11.052 STDOUT tofu: Changes to Outputs:
08:45:11.052 STDOUT tofu:   + vpc_subnet_id = (known after apply)
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d vpc
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.testdragon.dev/lock?id=pjg3335%252Ftest-atlantis%252Fvpc%252Fdefault%252F)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d vpc
  ```
Plan: 2 to add, 0 to change, 0 to destroy.

---
### Plan Summary

2 projects, 2 with changes, 0 with no changes, 0 failed

* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```